codeigniter/app/Controllers/ShoppingcartController.php

SELECT `ProductId`, `Quantity`, `Price_per_item`
FROM `Ordered_products`
WHERE `OrderId` = '62'
UPDATE `Products` SET `Quantity` = 11
WHERE `Products`.`ProductId` IN ('43')
DELETE FROM `Orders`
WHERE `OrderId` IN ('62')
DELETE FROM `Address`
WHERE `AddressId` IN ('62')
---
    public function removeOrder(){
        $Ordered_ProductsModel = model(Ordered_productsModel::class);
        $productModel = model(ProductModel::class);
        $productStatisticsModel = model(ProductStatisticsModel::class);

        $products = $Ordered_ProductsModel->select('ProductId')->select('Quantity')->select('Price_per_item')->where('OrderId', $this->request->getPost('orderId'))->findAll();

        $quantityAvailable = $productModel->getAvailableQuantity($products);

        for($item = 0; $item < count($products); $item++){
            //send notifications to users who wanted to buy it as well
            $this->sendNotifications($quantityAvailable[$item]->Quantity, $products[$item]['ProductId']);

            //add products quantity to database
            $data = [
                'Quantity' => $products[$item]['Quantity'] + $quantityAvailable[$item]->Quantity,
            ];
            $productModel->update($products[$item]['ProductId'], $data);
            //update product statistics
            $productStatisticsModel->decreaseRevenueAndQuantity($products[$item]['ProductId'], $products[$item]['Price_per_item'], $products[$item]['Quantity']);
        }

        $orderModel = model(OrdersModel::class);
        $AddressModel = model(AddressModel::class);

        //remove orderId's
        $orderModel->delete($this->request->getPost('orderId'));
        $AddressModel->delete($this->request->getPost('orderId'));

SELECT `Price`
FROM `Products`
WHERE `ProductId` = '44'
INSERT INTO `Ordered_products` (`Price_per_item`, `Quantity`, `ProductId`, `OrderId`) VALUES (('999'), 1, '44', 63)
---
    private function updateOrderAndRevenue($productModel, $primaryKey){
        $orderedProductsModel = model(Ordered_productsModel::class);
        $productStatisticsModel = model(ProductStatisticsModel::class);
        foreach(session('ShoppingCart') as $item){
            //save products belonging to order
            $price_per_item = $productModel->where('ProductId', $item['ProductId'])->findColumn('Price');
            $data = [
                'Price_per_item' => $price_per_item,
                'Quantity' => $item['Quantity'],
                'ProductId' => $item['ProductId'],
                'OrderId' => $primaryKey,
            ];
            $orderedProductsModel->insert($data);

UPDATE `Products` SET `Quantity` = 9
WHERE `Products`.`ProductId` IN ('44')
---
    private function removeAvailableQuantity($quantity, $productModel){
        //remove products quantity from database
        for($item = 0; $item < count(session('ShoppingCart')); $item++){
            $data = [
                'Quantity' => $quantity[$item]->Quantity - session('ShoppingCart')["$item"]["Quantity"],
            ];
            $productModel->update(session('ShoppingCart')["$item"]['ProductId'], $data);

INSERT INTO `Orders` (`AddressId`, `Delivery_choice`, `CustomerId`, `DeliveryDate`, `DeliveryTime`) VALUES (NULL, 'Collect', '33', '2023-02-16', 'Morning')
---
    private function saveOrderData($AddressPrimaryKey){
        $data = [
            'AddressId' => $AddressPrimaryKey,
            'Delivery_choice' => $this->request->getPost('deliver_option'),
            'CustomerId' => session('UserId'),
            'DeliveryDate' => $this->request->getPost('date_of_delivery'),
            'DeliveryTime' => $this->request->getPost('delivery_time')
        ];
        $OrderModels = model(OrdersModel::class);
        return $OrderModels->insert($data);