codeigniter/app/Models/UsersModel.php

SELECT `UserId`, `Fname`, `isVendor`, `Password`
FROM `Users`
WHERE `Email` = 'rune.rombouts@gmail.com'
---
    public function isValidUser($email, $password){
        $db = \Config\Database::connect();
        $queryResults = $db->table('Users')->select('UserId, Fname, isVendor, Password')->where('Email', $email)->get()->getResult();