codeigniter/app/Filters/completeProfileFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $model = model(VendorModel::class);
        $res = $model->select('Phone_number, Description, Company')->where('VendorId', session()->get('UserId'))->first();
---
SELECT `Phone_number`, `Description`, `Company`
FROM `Vendor`
WHERE `VendorId` = '33'
 LIMIT 1